# Python Core
# Модуль 5
# домашнє завдання 1
# Лопатін Євген

def caching_fibonacci(): # задаємо основну функцію
    cache = {} # створюємо порожній словник

    def fibonacci(n): # задаємо функцію всередені основній по калькуляці послідовності фібоначі
        if n <= 0:  # задаємо умови
            return 0
        if n == 1:
            return 1
        if n not in cache:  # перевіряємо чи вже є запис в словнику для n
            cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]  # повертаємо в словник після обчислення за умовами

    return fibonacci # повертаємо функцію в рекурсію

fib = caching_fibonacci() # вводимо змінну, яка викликає основну функцію

print(fib(10)) # виводимо перевірку для числа 10
print(fib(15)) # виводимо перевірку для числа 15