# Python Core
# Модуль 5
# домашнє завдання 2
# Лопатін Євген

import re # імпортуємо модуль для викоористання регулярних виражень
from typing import Callable

text = str("Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів.") # наш текст с числами
def generator_numbers(text: str): # створюємо функцію, яка приймає строку текса
    numbers = re.findall(r'\b\d+\.\d+\b', text) # використовуємо регулярні вирази для пошуку всіх чисел в сирому тексті
    for num in numbers:
        yield float(num)  # єлдім всі виявлені числа  в форматі float

def sum_profit(text: str, func: callable): # створюємо функцію, яка приймає текст та використовує першу функцію для парсингу чисел
    total = sum(generator_numbers(text))  # сумуємо всі виявлені числа
    return total # вертаємо змінну суми

total_income = sum_profit(text, generator_numbers) # створюємо змінну суми
print(f"Загальний дохід: {total_income} доларів") # виводимо змінну суми на екран терміналу

